app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "role" = ? WHERE "users"."id" = ?  [["updated_at", "2018-04-06 15:44:27.440325"], ["role", 0], ["id", 1]]
UPDATE "wikis" SET "private" = 'f' WHERE "wikis"."user_id" = ?  [["user_id", 1]]
---
  def downgrade
    @user = User.find(params[:id])
    @wikis = current_user.wikis
    puts "@user: #{@user.inspect} ---- current_user: #{current_user.inspect}"
    if @user == current_user
      @wikis.update_all(private: false)