app/controllers/wikis_controller.rb

SELECT "wikis".* FROM "wikis" WHERE "wikis"."private" = ?  [["private", "f"]]
SELECT "wikis".* FROM "wikis"
---
  def index
    if current_user == nil || current_user.role == 'member'
      @wikis = Wiki.where(private: false)
    else
      if current_user.role == 'premium'
        @wikis = Wiki.where('private=? OR user_id=?', false, current_user.id)
      else
        if current_user.role == 'admin'
          @wikis = Wiki.all

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT ?  [["id", 153], ["LIMIT", 1]]
---
  def show
    @wiki = Wiki.find(params[:id])

INSERT INTO "wikis" ("title", "body", "private", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @wiki = Wiki.new(wiki_params)
    @wiki.user = current_user

    if @wiki.save

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT ?  [["id", 171], ["LIMIT", 1]]
---
  def edit
    @wiki = Wiki.find(params[:id])

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT ?  [["id", 171], ["LIMIT", 1]]
UPDATE "wikis" SET "title" = ?, "updated_at" = ? WHERE "wikis"."id" = ?  [["title", "testing with edit"], ["updated_at", "2018-04-05 15:52:06.323278"], ["id", 171]]
---
  def update
    @wiki = Wiki.find(params[:id])
    @wiki.assign_attributes(wiki_params)
    authorize @wiki
    if @wiki.update(wiki_params)

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]
DELETE FROM "wikis" WHERE "wikis"."id" = ?  [["id", 101]]
---
  def destroy
    @wiki = Wiki.find(params[:id])
    authorize @wiki
    if @wiki.delete